laura-bin/2021_microcontroleurs/LB_PIC18F8722_Filtres/src/main.c
// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot Block (000000-007FFF, 000FFF or 001FFFh) not protected from table reads executed in other blocks)

#include <xc.h>
#include <math.h>
#include <stdio.h>

#include "SPI.h"

// PIC I/Os
#define SW_RUN              PORTEbits.RE0   // RUN / CONFIG mode switch
#define PB_PREV_MENU        PORTEbits.RE1   // previous menu entry selection push button (NC)
#define PB_NEXT_MENU        PORTEbits.RE2   // next menu entry selection push button (NC)
#define PB_VALUE_DN         PORTEbits.RE3   // value down push button (NC)
#define PB_VALUE_UP         PORTEbits.RE4   // value up push button (NC)
#define TICK                PORTGbits.RG0   // debug tick measuring the processing time of the interruption

// Modes
#define MODE_NONE           0       // no mode selected
#define MODE_RUN            1       // signal processing mode
#define MODE_CONFIG         2       // filter configuration mode

// Menu entries
#define M_FILTER            0       // filter type selection
#define M_SAMPLING          1       // sampling frequency selection
#define M_VALUE             2       // filter value selection
#define M_VALUE2            3       // filter second value selection (used by the echo filter)
#define M_COUNT             3       // count of menu entries
#define M_ECHO_COUNT        4       // count of menu entries for the echo filter

// Filters
#define F_MOV_AVG           0       // moving average filter
#define F_LOW_PASS          1       // low-pass filter
#define F_HIGH_PASS         2       // high-pass filter
#define F_ECHO              3       // echo filter
#define F_COUNT             4       // count of filters

// Parameters limit values
#define F_MOV_AVG_MIN       1       // moving average filter min value (2^1)
#define F_MOV_AVG_MAX       3       // moving average filter max value (2^3)
#define F_LOW_PASS_MIN      0       // low-pass filter min value
#define F_HIGH_PASS_MIN     0       // high-pass filter min value
#define F_ECHO_DEL_MIN      10      // echo filter min delay value (50 or 100 ms)
#define F_ECHO_DEL_MAX      3200    // echo filter max delay value (50 or 100 ms)
#define F_ECHO_N_MIN        1       // echo filter min number of echoes
#define F_ECHO_N_MAX        3       // echo filter max number of echoes
#define SAMPLING_MIN        8       // sampling frequency min value in kHz
#define SAMPLING_MAX        16      // sampling frequency max value in kHz

// Parameters steps
#define F_MOV_AVG_COEF_STEP 1       // moving average coefficient exponent step: 1
#define F_HL_PASS_STEP      100     // high and low-pass filter step: 100Hz
#define F_ECHO_DEL_STEP     400     // echo delay step: 400 spaes in the buffer (50 or 25ms)

#define COEF_SCALE          7       // filters coefficients scale: 2^7

#define SELECT_POS          19      // menu selector position

#define IN_BUF_SIZE  F_ECHO_DEL_MAX+1   // input signal buffer size
#define OUT_BUF_SIZE        1       // output signal buffer size

// Global variables (used by the interruption & the main program)
signed char sig_in[IN_BUF_SIZE];    // input signal buffer
signed char sig_out[OUT_BUF_SIZE];  // output signal buffer
int index[F_ECHO_N_MAX+1];          // input buffer indexes
int coef[F_ECHO_N_MAX+1];           // coefficients used to compute the output signal
char filter;                        // current filter selected
int sampling;                       // sampling frequency (8 or 16 kHz)
char mov_avg_coef;                  // moving average filter coefficient (1-3 -> 2, 4 or 8)
int low_cutoff;                     // low-pass filter cutoff frequency
int high_cutoff;                    // high-pass filter cutoff frequency
int echo_delay;                     // echo filter delay
int echoes;                         // echo filter number of echoes (1, 2 or 3)

// Display function
void display_parameters(void);                  // display all the parameters
void update_sampling_frequency(int new_val);    // update the sampling frequency and display it
void update_mov_avg_coef(char new_val);         // update the moving average coefficient and display it
void update_low_cutoff(int new_val);            // update the low cutoff frequency and display it
void update_high_cutoff(int new_val);           // update the high cutoff frequency and display it
void update_echo_delay(int new_val);            // update the echo delay and display it
void update_echoes(int new_val);                // update the number of echoes and display it

void __interrupt(high_priority) Int_Vect_High(void) {
    int i;
    long output;    // temporary variable used to compute the output signal value

    TICK = 1;                       // debug tick ON

    ADCON0bits.NOT_DONE = 1;        // analog to digital conversion, result in the input buffer
    while (ADCON0bits.NOT_DONE);
    sig_in[index[0]] = (signed char) (ADRESH - 128);

    output = 0;
    switch (filter) {
    case F_MOV_AVG:                 // moving average filter: Yt = SUM(i=0:coef-1) Xt-i / coef
        for (i = 0; i < 1<<mov_avg_coef; i++) output += sig_in[i];
        output = output >> mov_avg_coef;
        index[0]++;                     // increment the input buffer index
        if (index[0] == 1<<mov_avg_coef) index[0] = 0;
        break;
    case F_LOW_PASS:                    // low-pass filter: Yt = A * (Xt + Xt-1) + B * Yt-1
        output = coef[0]*(sig_in[0] + sig_in[1]) + coef[1]*sig_out[0];
        output = output >> COEF_SCALE;
        sig_in[1] = sig_in[0];             // shift the input signal value in the buffer
        sig_out[0] = (signed char) output; // store the output value in the buffer
        break;
    case F_HIGH_PASS:                   // low-pass filter: Yt = A * (Xt - Xt-1) + B * Yt-1
        output = coef[0]*(sig_in[0] - sig_in[1]) + coef[1]*sig_out[0];
        output = output >> COEF_SCALE;
        sig_in[1] = sig_in[0];             // shift the input signal value in the buffer
        sig_out[0] = (signed char) output; // store the output value in the buffer
        break;
    case F_ECHO:                   // echo filter: Yt = A Xt + B Xt-delay + ...
        for (i = 0; i <= echoes; i++) output += coef[i] * sig_in[index[i]];
        output = output >> COEF_SCALE;
        for (i = 0; i <= echoes; i++) {     // increment the input buffer indexes
            index[i]++;
            if (index[i] == IN_BUF_SIZE) index[i] = 0;
        }
        break;
    default:
        break;
    }

    SPI_DAC_CS = 0;         // send the output signal value to the DAC
    SSPIF = 0;
    SSPBUF = 0x10;          // MCP4922 mode x2
    while (!SSPIF);
    SSPIF = 0;
    SSPBUF = (unsigned char) (output + 128);
    while (!SSPIF);
    SPI_DAC_CS = 1;
    LDAC = 0;               // load the DAC
    LDAC = 1;

