laura-bin/2021_microcontroleurs/LB_PIC18F8722_Filtres/src/main.c
    TICK = 0;               // debug tick OFF
    PIR2bits.CCP2IF = 0;    // interruption flag cleared
}

void main(void) {
    int i;
    char menu_entry;        // current menu entry selected
    char prev_mode;         // previous mode selected: run, config or none
    int cutoff_max;         // high/low pass filter max cutoff value determined by the sampling frequency
    double omega;           // angular frequency used to initialize some filters coefficients

    // PIC configuration
    TRISE   = 0xFF;         // PORTE (menu buttons) -> input
    TRISGbits.TRISG0 = 0;   // TICK -> output
    TICK    = 0;
    ADCON0  = 0X01;         // ADC enabled on AN0
    ADCON1  = 0x0E;         // AN0 -> analogic
    ADCON2  = 0x01;         // Left justification, 0 Tad, 8 Tosc
    CCP2CON = 0x0B;         // CCP2 interruption in compare mode with trigger special event
    CCPR2H  = 0x04;         // 1250us -> 8kHz
    CCPR2L  = 0xE2;
    T1CON   = 0x01;         // Timer1 prescale 1:8
    TMR1H   = 0;            // Timer1 -> 0
    TMR1L   = 0;
    RCONbits.IPEN   = 1;    // enable priority levels on interrupts
    INTCONbits.GIEH = 0;    // high priority interrupts disabled
    INTCONbits.GIEL = 0;    // low priority interrupts disabled
    IPR2bits.CCP2IP = 1;    // CCP2 interrupt: high priority
    PIE2bits.CCP2IE = 1;    // CCP2 interrupt enabled
    PIR2bits.CCP2IF = 0;    // CCP2 interrupt flag cleared
    init_SPI();             // SPI bus and peripherals initialization

    // Parameters initialization
    prev_mode       = MODE_NONE;            // previous mode selected: none
    sampling        = (int) (10000 / ((CCPR2H << 8) + CCPR2L));     // sampling frequency determined by the CCP2 value
    cutoff_max      = sampling*1000 >> 1;   // low/high pass filter max value determined by the sampling frequency
    filter          = F_ECHO;               // filter selected: moving average
    mov_avg_coef    = F_MOV_AVG_MIN;        // moving average value: minimum
    low_cutoff      = F_LOW_PASS_MIN;       // low-pass cutoff value: minimum
    high_cutoff     = cutoff_max;           // high-pass cutoff value: maximum
    echo_delay      = F_ECHO_DEL_MAX;       // echo delay: minimum
    echoes          = F_ECHO_N_MIN;         // number of echoes: minimum
    display_parameters();

    // Main loop: polling on the RUN/CONFIG switch
    while (1) {
        if (SW_RUN) {
            if (prev_mode != MODE_RUN) {            // run mode initialization:
                prev_mode = MODE_RUN;                       // set the previous mode to RUN
                send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector

                index[0] = 0;                               // input buffer index to 0
                for (i = 0; i < IN_BUF_SIZE; i++) sig_in[i] = 0;    // input buffer to 0
                for (i = 0; i < OUT_BUF_SIZE; i++) sig_out[i] = 0;  // output buffer to 0

                switch (filter) {                   // depending on the filter selected:
                case F_LOW_PASS:                        // compute the low-pass filter coefficients
                    omega = 2.0 * M_PI * (double) low_cutoff / (double) sampling / 1000.0;
                    coef[0] = (signed char) round(omega / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    coef[1] = (signed char) round((2.0 - omega) / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    break;
                case F_HIGH_PASS:                       // or compute the low-pass filter coefficients
                    omega = 2.0 * M_PI * (double)high_cutoff / (double)sampling / 1000.0;
                    coef[0] = (signed char) round(2.0 / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    coef[1] = (signed char) round((2.0 - omega) / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    break;
                case F_ECHO:                            // or initialize the echoes indexes
                    for (i = 0; i < echoes; i++) index[echoes-i] = IN_BUF_SIZE - echo_delay/(i+1);
                    switch (echoes) {                   // and the echoes coefficients (total must be 128, 2^COEF_SCALE)
                    case 1:
                        coef[0] = 96;   // original signal
                        coef[1] = 32;   // echo
                        break;
                    case 2:
                        coef[0] = 88;   // original signal
                        coef[1] = 32;   // first echo
                        coef[2] = 8;    // second echo
                        break;
                    case 3:
                        coef[0] = 72;   // original signal
                        coef[1] = 32;   // first echo
                        coef[2] = 16;   // second echo
                        coef[3] = 8;    // third echo
                        break;
                    default:
                        break;
                    }
                    break;
                default:                            // other filters does not need a specific initialization
                    break;
                }
                INTCONbits.GIEH = 1;                // enable high priority interrupts
            }
        } else {
            if (prev_mode != MODE_CONFIG) {         // config mode initialization: 
                INTCONbits.GIEH = 0;                        // disable high priority interrupts
                prev_mode = MODE_CONFIG;                    // set the previous mode to CONFIG
                menu_entry = M_FILTER;                      // select the first menu
                send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector
            }

            if (!PB_PREV_MENU) {                        // previous menu selection:
                while (!PB_PREV_MENU);                      // wait the button release
                send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector
                if (!menu_entry) menu_entry = filter == F_ECHO ? M_ECHO_COUNT-1 : M_COUNT-1;
                else menu_entry--;                          // select the previous menu
                send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector

            } else if (!PB_NEXT_MENU) {                 // next menu selection:
                while (!PB_NEXT_MENU);                      // wait the button release
                send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector
                if (filter == F_ECHO && menu_entry == M_ECHO_COUNT-1) menu_entry = 0;
                else if (filter != F_ECHO && menu_entry == M_COUNT-1) menu_entry = 0;
                else menu_entry++;                          // select the next menu
                send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector

            } else if (!PB_VALUE_DN) {  // value down selection:
                while (!PB_VALUE_DN);       // wait the button release
                switch (menu_entry) {
                case M_FILTER:              // select the previous filter type
                    if (!filter) filter = F_COUNT-1;
                    else filter--;
                    display_parameters();
                    break;
                case M_SAMPLING:            // decrease the sampling frequency
                    if (sampling == SAMPLING_MAX) {
                        CCPR2H = (unsigned char) (CCPR2H << 1);
                        CCPR2L = (unsigned char) (CCPR2L << 1);
                        update_sampling_frequency(sampling >> 1);
                        cutoff_max = sampling*1000 >> 1;
                        update_echo_delay(echo_delay);
                        if (low_cutoff > cutoff_max) update_low_cutoff(cutoff_max);
                        if (high_cutoff > cutoff_max) update_high_cutoff(cutoff_max);
                    }
                    break;
                case M_VALUE:               // decrease the filter first value, either
                    switch (filter) {
                    case F_MOV_AVG:             // the moving average value
                        if (mov_avg_coef > F_MOV_AVG_MIN) update_mov_avg_coef(mov_avg_coef-F_MOV_AVG_COEF_STEP);
                        break;
                    case F_LOW_PASS:            // the low-pass filter cutoff frequency
                        if (low_cutoff > F_LOW_PASS_MIN) update_low_cutoff(low_cutoff-F_HL_PASS_STEP);
                        break;
                    case F_HIGH_PASS:           // the high-pass filter cutoff frequency
                        if (high_cutoff > F_HIGH_PASS_MIN) update_high_cutoff(high_cutoff-F_HL_PASS_STEP);
                        break;
                    case F_ECHO:                // the delay of the echo filter
                        if (echo_delay > F_ECHO_DEL_MIN) update_echo_delay(echo_delay-F_ECHO_DEL_STEP);
                        break;
                    default:
                        break;
                    }
                    break;
                case M_VALUE2:              // decrease the filter second value (the number of echoes)
                    if (echoes > F_ECHO_N_MIN) update_echoes(echoes-1);
                    break;
                default:
                    break;
                }

            } else if (!PB_VALUE_UP) {  // value up selection:
                while (!PB_VALUE_UP);       // wait the button release
                switch (menu_entry) {
                case M_FILTER:              // select the next filter type
                    if (filter == F_COUNT-1) filter = 0;
                    else filter++;
                    display_parameters();
                    break;
                case M_SAMPLING:            // increase the sampling frequency
                    if (sampling == SAMPLING_MIN) {
                        CCPR2H = CCPR2H >> 1;
                        CCPR2L = CCPR2L >> 1;
                        update_sampling_frequency(sampling << 1);
                        cutoff_max = sampling*1000 >> 1;
                        update_echo_delay(echo_delay);
                    }
                    break;
                case M_VALUE:               // increase the filter first value, either
                    switch (filter) {
                    case F_MOV_AVG:             // the moving average value
                        if (mov_avg_coef < F_MOV_AVG_MAX) update_mov_avg_coef(mov_avg_coef+F_MOV_AVG_COEF_STEP);
                        break;
                    case F_LOW_PASS:            // the low-pass filter cutoff frequency
                        if (low_cutoff < cutoff_max) update_low_cutoff(low_cutoff+F_HL_PASS_STEP);
                        break;
                    case F_HIGH_PASS:           // the high-pass filter cutoff frequency
                        if (high_cutoff < cutoff_max) update_high_cutoff(high_cutoff+F_HL_PASS_STEP);
                        break;
                    case F_ECHO:                // the delay of the echo filter
                        if (echo_delay < F_ECHO_DEL_MAX) update_echo_delay(echo_delay+F_ECHO_DEL_STEP);
                        break;
                    default:
                        break;
                    }
                    break;
                case M_VALUE2:              // increase the filter second value (the number of echoes)
                    if (echoes < F_ECHO_N_MAX) update_echoes(echoes+1);
                    break;
                default:
                    break;
                }
            }
        }
        __delay_ms(100);
    }
}

void display_parameters() {
    char text[19];
    switch (filter) {
    case F_MOV_AVG:
        send_text_LCD("Moving avg filter ", M_FILTER, 0);
        sprintf(text, "Sampling %6d Hz", sampling*1000);
        send_text_LCD(text, M_SAMPLING, 0);
        sprintf(text, "Coefficient %6d", 1 << mov_avg_coef);
        send_text_LCD(text, M_VALUE, 0);
        send_text_LCD("                  ", M_VALUE2, 0);
        break;
    case F_LOW_PASS:
        send_text_LCD("Low-pass filter   ", M_FILTER, 0);
        sprintf(text, "Sampling %6d Hz", sampling*1000);
        send_text_LCD(text, M_SAMPLING, 0);
        sprintf(text, "Cutoff %8u Hz", low_cutoff);
        send_text_LCD(text, M_VALUE, 0);
        send_text_LCD("                  ", M_VALUE2, 0);
        break;
    case F_HIGH_PASS:
        send_text_LCD("High-pass filter  ", M_FILTER, 0);
        sprintf(text, "Sampling %6d Hz", sampling*1000);
        send_text_LCD(text, M_SAMPLING, 0);
        sprintf(text, "Cutoff %8u Hz", high_cutoff);
        send_text_LCD(text, M_VALUE, 0);
        send_text_LCD("                  ", M_VALUE2, 0);
        break;
    case F_ECHO:
        send_text_LCD("Echo filter       ", M_FILTER, 0);
        sprintf(text, "Sampling %6d Hz", sampling*1000);
        send_text_LCD(text, M_SAMPLING, 0);
        sprintf(text, "Delay %9d ms", echo_delay / sampling);
        send_text_LCD(text, M_VALUE, 0);
        sprintf(text, "Echoes %11d", echoes);
        send_text_LCD(text, M_VALUE2, 0);
        break;
    default:
        break;
    }
}

void update_sampling_frequency(int new_val) {
    char text[19];
    sampling = new_val;
    sprintf(text, "%6d", sampling*1000);
    send_text_LCD(text, M_SAMPLING, 9);
}

void update_mov_avg_coef(char new_val) {
    char text[19];
    mov_avg_coef = new_val;
    if (filter == F_MOV_AVG) {
        sprintf(text, "%6d", 1 << mov_avg_coef);
        send_text_LCD(text, M_VALUE, 12);
    }
}

void update_low_cutoff(int new_val) {
    char text[19];
    low_cutoff = new_val;
    if (filter == F_LOW_PASS) {
        sprintf(text, "%8u", low_cutoff);
        send_text_LCD(text, M_VALUE, 7);
    }
}

void update_high_cutoff(int new_val) {
    char text[19];
    high_cutoff = new_val;
    if (filter == F_HIGH_PASS) {
        sprintf(text, "%8u", high_cutoff);
        send_text_LCD(text, M_VALUE, 7);
    }
}

void update_echo_delay(int new_val) {
    char text[19];
    echo_delay = new_val;
    if (filter == F_ECHO) {
        sprintf(text, "%9d", echo_delay / sampling);
        send_text_LCD(text, M_VALUE, 6);
    }
}

void update_echoes(int new_val) {
    char text[19];
    echoes = new_val;
    if (filter == F_ECHO) {
        sprintf(text, "%11d", echoes);
        send_text_LCD(text, M_VALUE2, 7);
    }
}
